Revit 2024 API
HermiteSplineTangents.StartTangent Property
 The tangent vector at the start of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ StartTangent { get; set; }
Visual Basic
Public Property StartTangent As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ StartTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
Field Value
 This must be a nomalized unit vector.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: startTangent is not length 1.0.
Autodesk.Revit.Exceptions.InapplicableDataException |  The start tangent value is not set.
See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace